AhmedMesh3/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-10 0 0)
    (20  0 0)
    (20  8 0)
    (-10 8 0)
    (-10 0 8)
    (20  0 8)
    (20  8 8)
    (-10 8 8)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 12 12) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
	symWall
	{
		type symmetry;
		faces
		(
			(1 5 4 0)
		);
	}
		outlet
	{
		type patch;
		faces
		(
			(2 6 5 1)
		);
	}

		upperWall
	{
		type patch;
		faces
		(
			(4 5 6 7)
		);
	}

		inlet
	{
		type patch;
		faces
		(
			(0 4 7 3)
		);
	}

		left
	{
		type patch;
		faces
		(
			(3 7 6 2)
		);
	}

		lowerWall
	{
		type wall;
		faces
		(
			(0 3 2 1)
		);
	}
);

// ************************************************************************* //
