AhmedMesh3/0/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

flowVelocity         (63.7 0 0);
pressure             0;
turbulentKE          21.9; //0.24 for 20 //1.5 for 50
turbulentOmega       29215; //1.78 for 20 //44.72 for 50

// ************************************************************************* //
